app/Http/Controllers/SiteController.php

    public function home(): View
    {
        $banners = Banner::all()->sortBy('order');
---
select * from "banners"